In [13]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np
import IPython

In [5]:
df = pd.DataFrame(np.random.randn(8, 3), index=list('qwertyio'),
                      columns=['A', 'B', 'C'])
df

          A         B         C
q  0.006587  0.227191  1.997682
w -1.502900 -1.761053  1.805838
e -0.619473  0.538775 -0.327783
r  0.294103  0.328887 -0.473790
t -1.366228  0.210255 -1.631169
y  1.037291 -0.653431  0.400779
i -0.077234 -0.777528 -0.913224
o  0.343396  1.279382  2.075866

In [6]:
df.columns = [x.lower() for x in df.columns]
df

          a         b         c
q  0.006587  0.227191  1.997682
w -1.502900 -1.761053  1.805838
e -0.619473  0.538775 -0.327783
r  0.294103  0.328887 -0.473790
t -1.366228  0.210255 -1.631169
y  1.037291 -0.653431  0.400779
i -0.077234 -0.777528 -0.913224
o  0.343396  1.279382  2.075866

In [11]:
df.a.array

<PandasArray>
[0.006586921373630511,  -1.5029001385212675,  -0.6194730545146011,
  0.29410313050868053,  -1.3662280866955283,   1.0372906854437083,
 -0.07723360882158799,  0.34339563114236654]
Length: 8, dtype: float64

In [12]:
data = np.random.randint(0, 7, size=50)
data

array([1, 5, 1, 2, 2, 5, 2, 1, 4, 6, 6, 5, 4, 2, 5, 6, 0, 3, 3, 0, 0, 1,
       3, 5, 4, 5, 5, 5, 6, 1, 3, 6, 0, 4, 3, 6, 3, 4, 1, 0, 6, 5, 4, 4,
       3, 0, 5, 0, 2, 6])

In [20]:
s = Series(data)

In [21]:
s.value_counts()

5    10
6     8
4     7
0     7
3     7
1     6
2     5
dtype: int64

In [24]:
s5 = pd.Series([1, 1, 3, 3, 3, 5, 5, 7, 7, 7])
s5.mode()

0    3
1    7
dtype: int64

In [28]:
df5 = pd.DataFrame({"A": np.random.randint(0, 7, size=50),
   .....:                     "B": np.random.randint(-10, 15, size=50)})
# df5

    A   B
0   3  10
1   4  12
2   2   6
3   4  -2
4   6 -10
5   1   3
6   3   6
7   5  -1
8   1   1
9   1  -8
10  6  -5
11  3  11
12  6  -3
13  6  10
14  0 -10
15  1   6
16  5 -10
17  5   0
18  5   2
19  2  11
20  0   2
21  1  -3
22  5   1
23  4  -6
24  6  -4
25  2   2
26  4  -5
27  0  11
28  1  -8
29  3  -4
30  0   2
31  0  12
32  4  -2
33  1   2
34  4  -5
35  4   4
36  0   7
37  2  -7
38  1  -6
39  4   2
40  0  -1
41  2   1
42  1  12
43  3  11
44  3   4
45  4  -9
46  3   5
47  2   2
48  6   9
49  4  -9

In [29]:
df5.mode()

   A  B
0  4  2

In [34]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    0.545773
b    0.543970
c   -0.298880
d   -0.061622
e    0.278419
dtype: float64

In [42]:
s.reindex(['e', 'b', 'f', 'd'])

e    0.278419
b    0.543970
f         NaN
d   -0.061622
dtype: float64

In [43]:
df = pd.DataFrame({
     'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
     'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
     'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a -0.515209 -1.972390       NaN
b  0.323982 -1.158456 -0.490417
c -1.608844  0.444514  0.002474
d       NaN  0.255166  0.792975

In [45]:
df.reindex(index=list('cbar'), columns=['three', 'two', 'one', 'zero'])

      three       two       one  zero
c  0.002474  0.444514 -1.608844   NaN
b -0.490417 -1.158456  0.323982   NaN
a       NaN -1.972390 -0.515209   NaN
r       NaN       NaN       NaN   NaN

In [48]:
df.reindex(['c', 'f', 'b'], axis='index')

        one       two     three
c -1.608844  0.444514  0.002474
f       NaN       NaN       NaN
b  0.323982 -1.158456 -0.490417

In [53]:
df

        one       two     three
a -0.515209 -1.972390       NaN
b  0.323982 -1.158456 -0.490417
c -1.608844  0.444514  0.002474
d       NaN  0.255166  0.792975

In [56]:
df.drop(['a', 'd'], axis=0)

        one       two     three
b  0.323982 -1.158456 -0.490417
c -1.608844  0.444514  0.002474

In [58]:
df.drop(['one'], axis=1)

        two     three
a -1.972390       NaN
b -1.158456 -0.490417
c  0.444514  0.002474
d  0.255166  0.792975

In [59]:
s

a    0.545773
b    0.543970
c   -0.298880
d   -0.061622
e    0.278419
dtype: float64

In [63]:
s.rename(str.upper)

A    0.545773
B    0.543970
C   -0.298880
D   -0.061622
E    0.278419
dtype: float64

In [64]:
df

        one       two     three
a -0.515209 -1.972390       NaN
b  0.323982 -1.158456 -0.490417
c -1.608844  0.444514  0.002474
d       NaN  0.255166  0.792975

In [65]:
df.rename(columns={'one': 'foo', 'two': 'bar'},
              index={'a': 'apple', 'b': 'banana', 'd': 'durian'})

             foo       bar     three
apple  -0.515209 -1.972390       NaN
banana  0.323982 -1.158456 -0.490417
c      -1.608844  0.444514  0.002474
durian       NaN  0.255166  0.792975

In [66]:
df.rename({'one': 'foo', 'two': 'bar'}, axis='columns')

        foo       bar     three
a -0.515209 -1.972390       NaN
b  0.323982 -1.158456 -0.490417
c -1.608844  0.444514  0.002474
d       NaN  0.255166  0.792975

In [67]:
df.rename({'a': 'apple'}, axis=0)

            one       two     three
apple -0.515209 -1.972390       NaN
b      0.323982 -1.158456 -0.490417
c     -1.608844  0.444514  0.002474
d           NaN  0.255166  0.792975

In [70]:
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [71]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int64

In [72]:
s.dt.year

0    2013
1    2013
2    2013
3    2013
dtype: int64

In [73]:
s.dt.dayofweek

0    1
1    2
2    3
3    4
dtype: int64

In [77]:
stz = s.dt.tz_localize('US/Eastern')
stz

0   2013-01-01 09:10:12-05:00
1   2013-01-02 09:10:12-05:00
2   2013-01-03 09:10:12-05:00
3   2013-01-04 09:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [78]:
stz.dt.tz

In [79]:
s.dt.tz_localize('UTC').dt.tz_convert('US/Eastern')

0   2013-01-01 04:10:12-05:00
1   2013-01-02 04:10:12-05:00
2   2013-01-03 04:10:12-05:00
3   2013-01-04 04:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [80]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'],
                  dtype="string")
s

0       A
1       B
2       C
3    Aaba
4    Baca
5    <NA>
6    CABA
7     dog
8     cat
dtype: string

In [82]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

In [84]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a  0.111042 -0.853028       NaN
b  0.569558 -0.025531 -0.932470
c  1.265381  0.730132  0.596194
d       NaN -2.589784 -1.429733

In [85]:
unsorted_df = df.reindex(index=['a', 'd', 'c', 'b'],
                          columns=['three', 'two', 'one'])
unsorted_df

      three       two       one
a       NaN -0.853028  0.111042
d -1.429733 -2.589784       NaN
c  0.596194  0.730132  1.265381
b -0.932470 -0.025531  0.569558

In [86]:
unsorted_df.sort_index()

      three       two       one
a       NaN -0.853028  0.111042
b -0.932470 -0.025531  0.569558
c  0.596194  0.730132  1.265381
d -1.429733 -2.589784       NaN

In [87]:
unsorted_df.sort_index(ascending=False)

      three       two       one
d -1.429733 -2.589784       NaN
c  0.596194  0.730132  1.265381
b -0.932470 -0.025531  0.569558
a       NaN -0.853028  0.111042

In [89]:
unsorted_df.sort_index(axis=1)

        one     three       two
a  0.111042       NaN -0.853028
d       NaN -1.429733 -2.589784
c  1.265381  0.596194  0.730132
b  0.569558 -0.932470 -0.025531

In [91]:
unsorted_df['three'].sort_index()

a         NaN
b   -0.932470
c    0.596194
d   -1.429733
Name: three, dtype: float64

In [93]:
df1 = pd.DataFrame({'one': [2, 1, 1, 1],
                        'two': [1, 3, 2, 4],
                        'three': [5, 4, 3, 2]})
df1

   one  two  three
0    2    1      5
1    1    3      4
2    1    2      3
3    1    4      2

In [95]:
df1.sort_values(by='two')

   one  two  three
0    2    1      5
2    1    2      3
1    1    3      4
3    1    4      2

In [98]:
df1[['one', 'two', 'three']].sort_values(['one', 'two'])

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

In [99]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5    <NA>
6    CABA
7     dog
8     cat
dtype: string

In [100]:
s[2] = np.nan
s

0       A
1       B
2    <NA>
3    Aaba
4    Baca
5    <NA>
6    CABA
7     dog
8     cat
dtype: string

In [101]:
s.sort_values()

0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
2    <NA>
5    <NA>
dtype: string

In [102]:
s.sort_values(na_position='first')

2    <NA>
5    <NA>
0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
dtype: string

In [104]:
idx = pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('a', 2),
                                   ('b', 2), ('b', 1), ('b', 1)])
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 2),
            ('b', 2),
            ('b', 1),
            ('b', 1)],
           )

In [106]:
idx.names = ['first', 'second']

In [108]:
df_multi = pd.DataFrame({'Values': np.arange(6, 0, -1)},
                            index=idx)
df_multi

              Values
first second
a     1            6
      2            5
      2            4
b     2            3
      1            2
      1            1

In [109]:
df_multi.sort_values(by=['second', 'Values'])

              Values
first second
b     1            1
      1            2
a     1            6
b     2            3
a     2            4
      2            5